# Pandas Review

In [5]:
# import 
import pandas as pd

# Seies

* Series은 실제로 자주 선언해서 사용하지 않음

In [9]:
# 리스트 선언
list_var = ['a', 'b', 'c', 'd']
list_var
# 가로형 data

['a', 'b', 'c', 'd']

In [10]:
# series 선언 with list
series_var = pd.Series(list_var, index=[1,2,3,4]) # index 지정
series_var
# 세로형 data

1    a
2    b
3    c
4    d
dtype: object

In [11]:
# 타입 확인
type(series_var)

pandas.core.series.Series

In [12]:
# series 선언 with dict
series_var2 = pd.Series({1:'a', 2:'b', 3:'c', 4:'d'})
series_var2 # 확인

1    a
2    b
3    c
4    d
dtype: object

# DataFrame
* DataFrame = Series + Series + Series + Series +...
* 2차원 데이터 구조

In [13]:
# Dataframe 선언
df = pd.DataFrame({'name':['yejin', 'jiwon', 'sanghyeon'],
                   'age' : ['25','22', '32'],
                   'gender' : [1, 1, 0]})
df

        name age  gender
0      yejin  25       1
1      jiwon  22       1
2  sanghyeon  32       0

## Indexing

In [14]:
# columns의 data 넣어서 확인
df['age']

0    25
1    22
2    32
Name: age, dtype: object

In [15]:
# type 확인
type(df['age']) # Series

pandas.core.series.Series

## infomation
* `info()`
* 필수적으로 사용해서 확인해야한다.
* Columns에 대한 대략적 정보(어떤 데이터타입으로 구성, 종류 등, 빈 데이터)

In [16]:
# info를 하기 앞의 데이터를 확인
# head() - 앞에서부터 5개 가져오기, 안에 값을 넣어줘서 출력 개수 조절 가능
df.head()

        name age  gender
0      yejin  25       1
1      jiwon  22       1
2  sanghyeon  32       0

In [17]:
# 데이터 확인 후 info 사용 
df.info() # 전반적인 데이터 구조확인
# Dtype은 컴퓨터가 자동으로 사용

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      object
 2   gender  3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [18]:
# 위에서 age는 연산을 해야되므로 int형으로 바꿔준다.
# astype() 사용
df['age'].astype(int)

0    25
1    22
2    32
Name: age, dtype: int32

In [19]:
# 위는 기본 데이터는 변경되지 않는다.
df['age']

0    25
1    22
2    32
Name: age, dtype: object

In [20]:
# 데이터 변경
df['age'] = df['age'].astype(int)
df['age'] # 결과 확인

0    25
1    22
2    32
Name: age, dtype: int32

In [21]:
# 기본 수학연산
print(df['age'].sum()) # 합
print(df['age'].max()) # 최대
print(df['age'].min()) # 최소
print(df['age'].mean()) # 평균
print(df['age'].median()) # 중앙값
print(df['age'].var()) # 분산
print(df['age'].std()) # 표준 편차

79
32
22
26.333333333333332
25.0
26.333333333333332
5.131601439446884

In [22]:
# 기본적 수학연산에 대해서 보여줌
df.describe() 
# 하지만 사용하기 에매하다. 실제로 데이터가 깔끔하지 않음.
# data의 개수, 평균, std, 최소, 최대, 중간값 등을 나타냄

             age    gender
count   3.000000  3.000000
mean   26.333333  0.666667
std     5.131601  0.577350
min    22.000000  0.000000
25%    23.500000  0.500000
50%    25.000000  1.000000
75%    28.500000  1.000000
max    32.000000  1.000000

## Indexing

In [26]:
df # 데이터프레임 내용 확인

        name  age  gender
0      yejin   25       1
1      jiwon   22       1
2  sanghyeon   32       0

In [27]:
# indexing
df[df['name'] == 'jiwon'] # 이름이 지원인 데이터만 가져오기

    name  age  gender
1  jiwon   22       1

In [28]:
df[(df['age'] > 20) & (df['gender'] == 1)]

    name  age  gender
0  yejin   25       1
1  jiwon   22       1

In [29]:
df['age'] > 20

0    True
1    True
2    True
Name: age, dtype: bool

In [31]:
df['gender'] == 1

0     True
1     True
2    False
Name: gender, dtype: bool

In [32]:
df[df['age'] > 20 | (df['gender'] =='1')]

        name  age  gender
0      yejin   25       1
1      jiwon   22       1
2  sanghyeon   32       0

In [33]:
# 뒤에 loc, iloc 사용을 위해 사용
df = pd.DataFrame({'name':['yejin', 'jiwon', 'sanghyeon'],
                   'age' : ['25','22', '32'],
                   'gender' : [1, 1, 0]}, index = ['a','b','c'])
df

        name age  gender
a      yejin  25       1
b      jiwon  22       1
c  sanghyeon  32       0

In [35]:
# loc index 기반 접근
df.loc['a']

name      yejin
age          25
gender        1
Name: a, dtype: object

In [36]:
# iloc 위치(순서) 기반
df.iloc[0]

name      yejin
age          25
gender        1
Name: a, dtype: object

In [38]:
# indexing - 1
df.iloc[0]['name'] # index로 먼저 뽑고, 해당하는 Colums의 데이터 뽑기

'yejin'

In [39]:
# indexing - 2
print(df.name[0])
print(df.name.iloc[0]) # 순서가 Columns을 먼저 뽑고, 해당하는 index에 대한 데이터 뽑기
print(df.name.loc['a']) # 순서가 Columns을 먼저 뽑고, 해당하는 index에 대한 데이터 뽑기

yejin
yejin
yejin

In [41]:
# name의 특성 확인
df.name

a        yejin
b        jiwon
c    sanghyeon
Name: name, dtype: object

In [43]:
# 데이터 타입 확인
type(df.name)

pandas.core.series.Series

## DataFrame - 합치기
* Concat
* Merge

In [44]:
df1 = pd.DataFrame({'A':[1,2,3,4],
                    'B':[5,6,7,8],
                    'C':[9,10,11,12]})
df1

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [45]:
df2 = pd.DataFrame({'A':[13,14,15,16],
                    'B':[17,18,19,20],
                    'C':[21,22,23,24]})
df2

    A   B   C
0  13  17  21
1  14  18  22
2  15  19  23
3  16  20  24

In [47]:
# concat(위 아래로 붙이는 방법)
df3 = pd.concat([df1,df2]) # 기본 axis = 0으로 설정(index 기준)
df3

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
0  13  17  21
1  14  18  22
2  15  19  23
3  16  20  24

In [48]:
# index 다시 설정
df3.reset_index()

   index   A   B   C
0      0   1   5   9
1      1   2   6  10
2      2   3   7  11
3      3   4   8  12
4      0  13  17  21
5      1  14  18  22
6      2  15  19  23
7      3  16  20  24

In [49]:
# index 다시 설정
df3.reset_index(drop=True) # 기존 index를 제거하면서 붙임,.

    A   B   C
0   1   5   9
1   2   6  10
2   3   7  11
3   4   8  12
4  13  17  21
5  14  18  22
6  15  19  23
7  16  20  24

In [50]:
# 옆으로 붙이기 
df4 = pd.concat([df1,df2], axis = 1) # axis 1은 Columns 기준
df4

   A  B   C   A   B   C
0  1  5   9  13  17  21
1  2  6  10  14  18  22
2  3  7  11  15  19  23
3  4  8  12  16  20  24

## Data 추가 및 삭제
* dictionary와 비슷
* 삭제
    * drop 
    * del

In [51]:
# 데이터 선언
df1 = pd.DataFrame({'A':[1,2,3,4],
                    'B':[5,6,7,8],
                    'C':[9,10,11,12]})
df1

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [54]:
# 추가 M1
df1['D'] = [17, 18, 19, 20]
df1

   A  B   C   D
0  1  5   9  17
1  2  6  10  18
2  3  7  11  19
3  4  8  12  20

In [55]:
# 삭제 M1
df1.drop('A', axis =1)

   B   C   D
0  5   9  17
1  6  10  18
2  7  11  19
3  8  12  20

In [56]:
# 삭제 M1 
df1 # 원본에 영향 X

   A  B   C   D
0  1  5   9  17
1  2  6  10  18
2  3  7  11  19
3  4  8  12  20

In [57]:
# 삭제 M1
df1.drop('A', axis=1, inplace=True)
df1 # 원본에 반영됨.

   B   C   D
0  5   9  17
1  6  10  18
2  7  11  19
3  8  12  20

In [58]:
# 삭제 M2
del df1['D'] # 원본에 바로 영향
df1 # 확인

   B   C
0  5   9
1  6  10
2  7  11
3  8  12

# Groupby
* 엄청나게 많이 사용 중요!

In [62]:
# 데이터 먼저 선언
data = {'Company' : ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person' : ['Sam', 'Charlie', 'Amy', 'Veamessa', 'Carl', 'Sarah'],
       'Sales' : [200, 120, 340, 124, 243, 350]}
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Veamessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [61]:
# 데이터 프레임 만들기
df = pd.DataFrame(data)
df

  Company    Person  Sales
0    GOOG       Sam    200
1    GOOG   Charlie    120
2    MSFT       Amy    340
3    MSFT  Veamessa    124
4      FB      Carl    243
5      FB     Sarah    350

* value_counts()
* 해당 데이터들이 가지고 있는 종류와 개수를 보여줌.

In [63]:
df['Company'].value_counts()

GOOG    2
MSFT    2
FB      2
Name: Company, dtype: int64

In [69]:
# 회사별로 Sales 평균 출력 good
print(df[df['Company'] == 'GOOG']['Sales'].mean())
print(df[df['Company'] == 'MSFT']['Sales'].mean())
print(df[df['Company'] == 'FB']['Sales'].mean())

160.0
232.0
296.5

In [71]:
# 위에 방법에 대한 힌트1
# 회사명이 
df[df['Company'] == 'GOOG'] # 확인해보기

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120

In [72]:
# 위에 방법에 대한 힌트
df[df['Company'] == 'GOOG']['Sales'] #확인해보기

0    200
1    120
Name: Sales, dtype: int64

## Unique()
* 배열의 형태로 들어온다.
* Data의 형태에 대한 정보도 제공

In [74]:
df['Company'].unique() # 회사명을 배열의 형태로

array(['GOOG', 'MSFT', 'FB'], dtype=object)

In [77]:
# unique가 리스트로 가져오기 때문에 for문에 사용가능
for com in df['Company'].unique():
    print(com)

GOOG
MSFT
FB

In [78]:
# 회사별로 회사명과, 평균 Sales 출력
for com in df['Company'].unique():
    print(com, df[df['Company'] == com]['Sales'].mean())

GOOG 160.0
MSFT 232.0
FB 296.5

## real Groupby
* `.groupby('')` 로 사용
* ''의 데이터로 묶어줌
* 눈으로 확인이 어려움. -> 리스트로 따로 선언해서 사용

In [81]:
# 기본
df.groupby('Company') # 그냥은 안보임

In [82]:
# 확인
list(df.groupby('Company')) # 리스트로 묶어서 확인

[('FB',
    Company Person  Sales
  4      FB   Carl    243
  5      FB  Sarah    350),
 ('GOOG',
    Company   Person  Sales
  0    GOOG      Sam    200
  1    GOOG  Charlie    120),
 ('MSFT',
    Company    Person  Sales
  2    MSFT       Amy    340
  3    MSFT  Veamessa    124)]

In [84]:
# 데이터 프레이믕로 만들수 없음
pd.DataFrame(df.groupby('company'))

KeyError: 'company'

In [88]:
# 위의 평균 출력 
# Company로 분류하여 그중 Sales만 평균내서 보여라 의미
df.groupby('Company')['Sales'].mean()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [89]:
df.columns

Index(['Company', 'Person', 'Sales'], dtype='object')

In [90]:
# Company의 Columns를 기준으로 묶고 이에 대한 계산!
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [91]:
# 두개 이상으로도 묶을 수 있음!
# Company 와 Person 두개의 columns로 묶음.
df.groupby(['Company','Person']).mean()

                  Sales
Company Person
FB      Carl      243.0
        Sarah     350.0
GOOG    Charlie   120.0
        Sam       200.0
MSFT    Amy       340.0
        Veamessa  124.0

In [93]:
# count이용
df.groupby('Company').count() # 개수 출력

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [94]:
# describe이용
df.groupby('Company').describe()
# 나중에 사용 X 
# 데이터 전부에 대해서 사용을 하면, 데이터가 많아지면, 너무 길어지고 보기 힘듬. bad!

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

## 정렬
* sort_values(by = '')
    * by는 생략가능
    * inplace로 원본 변경가능
    * 내부에 list 사용가능

In [98]:
# 데이터 선언
df = pd.DataFrame({'수학점수':[65, 80, 60, 80],
                   '과학점수':[50, 80, 60, 90],
                   '내신등급':[4, 2, 3, 1]})
df

   수학점수  과학점수  내신등급
0    65    50     4
1    80    80     2
2    60    60     3
3    80    90     1

In [96]:
# 기본
df.sort_values('수학점수')

   수학점수  과학점수  내신등급
2    60    60     3
0    65    50     4
1    80    80     2
3    80    90     1

In [97]:
# by 사용
df.sort_values(by='수학점수')

   수학점수  과학점수  내신등급
2    60    60     3
0    65    50     4
1    80    80     2
3    80    90     1

In [99]:
# ascending 
df.sort_values(by ='수학점수', ascending =False) # 내림차순

   수학점수  과학점수  내신등급
1    80    80     2
3    80    90     1
0    65    50     4
2    60    60     3

In [100]:
# 두가지 상황에 대한 정렬
# 앞을 우선으로 해서 사용
df.sort_values(by = ['수학점수','과학점수'])

   수학점수  과학점수  내신등급
2    60    60     3
0    65    50     4
1    80    80     2
3    80    90     1

In [101]:
# 오름차순 내림차순도 바꿔서 정렬 가능
df.sort_values(by = ['수학점수','과학점수'], ascending=[True, False])

   수학점수  과학점수  내신등급
2    60    60     3
0    65    50     4
3    80    90     1
1    80    80     2

In [102]:
# 하지만 원본에 영향 X
df

   수학점수  과학점수  내신등급
0    65    50     4
1    80    80     2
2    60    60     3
3    80    90     1

In [104]:
# inplace 
df.sort_values(by = ['수학점수','과학점수'], inplace=True,)
df # 확인

   수학점수  과학점수  내신등급
2    60    60     3
0    65    50     4
1    80    80     2
3    80    90     1

## Map
* 데이터 변환할때 사용

In [106]:
# 데이터 프레임 다시 확인
df

   수학점수  과학점수  내신등급
2    60    60     3
0    65    50     4
1    80    80     2
3    80    90     1

In [118]:
# map을 사용하기 위해서 선언
mapping = {3:'B', 4:'B', 1:'A', 2:'A'} # 이거로 바꾸겠다.
print(mapping)

{3: 'B', 4: 'B', 1: 'A', 2: 'A'}

In [119]:
# 변환
# 기존 데이터에 영향을 안주기 위해서 새로운 Columns로 사용
df['내신등급2'] = df['내신등급'].map(mapping)
# 해당 방식은 데이터가 많아지면 데이터가 너무 커진다.
# 확인
df

   수학점수  과학점수  내신등급 내신등급2
2    60    60     3     B
0    65    50     4     B
1    80    80     2     A
3    80    90     1     A